{
  "model_type": "llama",
  "hidden_size": 256,
  "num_hidden_layers": 4,
  "intermediate_size": 1024,
  "num_attention_heads": 4,
  "num_key_value_heads": 4,
  "head_dim": 64,
  "rope_theta": 10000.0,
  "rope_traditional": false,
  "rope_scaling": null,
  "max_position_embeddings": 2048,
  "rms_norm_eps": 1e-5,
  "vocab_size": 32000,
  "tie_word_embeddings": true,
  "architectures": [
    "LlamaForCausalLM"
  ]
}
