{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "\"": 5,
      ",": 6,
      ".": 7,
      ":": 8,
      "e": 9,
      "t": 10,
      "x": 11,
      "{": 12,
      "}": 13,
      "가": 14,
      "각": 15,
      "간": 16,
      "경": 17,
      "고": 18,
      "공": 19,
      "과": 20,
      "구": 21,
      "그": 22,
      "기": 23,
      "는": 24,
      "능": 25,
      "닝": 26,
      "다": 27,
      "더": 28,
      "데": 29,
      "도": 30,
      "등": 31,
      "딥": 32,
      "램": 33,
      "러": 34,
      "력": 35,
      "로": 36,
      "록": 37,
      "론": 38,
      "류": 39,
      "를": 40,
      "리": 41,
      "망": 42,
      "머": 43,
      "반": 44,
      "복": 45,
      "분": 46,
      "수": 47,
      "술": 48,
      "습": 49,
      "신": 50,
      "실": 51,
      "알": 52,
      "야": 53,
      "어": 54,
      "언": 55,
      "여": 56,
      "연": 57,
      "예": 58,
      "으": 59,
      "은": 60,
      "을": 61,
      "의": 62,
      "이": 63,
      "인": 64,
      "있": 65,
      "자": 66,
      "잡": 67,
      "종": 68,
      "즘": 69,
      "지": 70,
      "처": 71,
      "추": 72,
      "측": 73,
      "컴": 74,
      "터": 75,
      "턴": 76,
      "통": 77,
      "패": 78,
      "퓨": 79,
      "프": 80,
      "하": 81,
      "학": 82,
      "한": 83,
      "할": 84,
      "해": 85,
      "현": 86,
      "\":": 87,
      "\"}": 88,
      ".\"}": 89,
      "ex": 90,
      "tex": 91,
      "{\"": 92,
      "컴퓨": 93,
      "text": 94,
      "컴퓨터": 95,
      "기술": 96,
      "능력": 97,
      "러닝": 98,
      "인공": 99,
      "하는": 100,
      "학습": 101,
      "간의": 102,
      "도록": 103,
      "머신": 104,
      "분야": 105,
      "이다": 106,
      "인간의": 107,
      "있도록": 108,
      "지능": 109,
      "처리": 110,
      "통해": 111,
      "하고": 112,
      "컴퓨터가": 113,
      "기술이다": 114,
      "러닝은": 115,
      "인공지능": 116,
      "분야로": 117,
      "경망": 118,
      "고리": 119,
      "과학": 120,
      "구한": 121,
      "그램": 122,
      "기반": 123,
      "데이": 124,
      "등을": 125,
      "딥러닝은": 126,
      "로그램": 127,
      "류로": 128,
      "복잡": 129,
      "신경망": 130,
      "실현": 131,
      "알고리": 132,
      "어를": 133,
      "언어를": 134,
      "연어": 135,
      "연구한": 136,
      "예측": 137,
      "으로": 138,
      "이해": 139,
      "있다": 140,
      "자연어": 141,
      "종류로": 142,
      "즘과": 143,
      "지각": 144,
      "추론": 145,
      "터를": 146,
      "턴을": 147,
      "패턴을": 148,
      "프로그램": 149,
      "하여": 150,
      "기술을": 151,
      "러닝의": 152,
      "인공신경망": 153,
      "학습할": 154,
      "학습하고": 155,
      "머신러닝은": 156,
      "머신러닝의": 157,
      "처리는": 158,
      "처리할": 159,
      "인공지능은": 160,
      "인공지능의": 161,
      "과학의": 162,
      "기반으로": 163,
      "데이터를": 164,
      "복잡한": 165,
      "실현하는": 166,
      "알고리즘과": 167,
      "연구한다": 168,
      "예측할": 169,
      "이해하고": 170,
      "프로그램을": 171,
      "인공신경망을": 172
    },
    "merges": [
      [
        "\"",
        ":"
      ],
      [
        "\"",
        "}"
      ],
      [
        ".",
        "\"}"
      ],
      [
        "e",
        "x"
      ],
      [
        "t",
        "ex"
      ],
      [
        "{",
        "\""
      ],
      [
        "컴",
        "퓨"
      ],
      [
        "tex",
        "t"
      ],
      [
        "컴퓨",
        "터"
      ],
      [
        "기",
        "술"
      ],
      [
        "능",
        "력"
      ],
      [
        "러",
        "닝"
      ],
      [
        "인",
        "공"
      ],
      [
        "하",
        "는"
      ],
      [
        "학",
        "습"
      ],
      [
        "간",
        "의"
      ],
      [
        "도",
        "록"
      ],
      [
        "머",
        "신"
      ],
      [
        "분",
        "야"
      ],
      [
        "이",
        "다"
      ],
      [
        "인",
        "간의"
      ],
      [
        "있",
        "도록"
      ],
      [
        "지",
        "능"
      ],
      [
        "처",
        "리"
      ],
      [
        "통",
        "해"
      ],
      [
        "하",
        "고"
      ],
      [
        "컴퓨터",
        "가"
      ],
      [
        "기술",
        "이다"
      ],
      [
        "러닝",
        "은"
      ],
      [
        "인공",
        "지능"
      ],
      [
        "분야",
        "로"
      ],
      [
        "경",
        "망"
      ],
      [
        "고",
        "리"
      ],
      [
        "과",
        "학"
      ],
      [
        "구",
        "한"
      ],
      [
        "그",
        "램"
      ],
      [
        "기",
        "반"
      ],
      [
        "데",
        "이"
      ],
      [
        "등",
        "을"
      ],
      [
        "딥",
        "러닝은"
      ],
      [
        "로",
        "그램"
      ],
      [
        "류",
        "로"
      ],
      [
        "복",
        "잡"
      ],
      [
        "신",
        "경망"
      ],
      [
        "실",
        "현"
      ],
      [
        "알",
        "고리"
      ],
      [
        "어",
        "를"
      ],
      [
        "언",
        "어를"
      ],
      [
        "연",
        "어"
      ],
      [
        "연",
        "구한"
      ],
      [
        "예",
        "측"
      ],
      [
        "으",
        "로"
      ],
      [
        "이",
        "해"
      ],
      [
        "있",
        "다"
      ],
      [
        "자",
        "연어"
      ],
      [
        "종",
        "류로"
      ],
      [
        "즘",
        "과"
      ],
      [
        "지",
        "각"
      ],
      [
        "추",
        "론"
      ],
      [
        "터",
        "를"
      ],
      [
        "턴",
        "을"
      ],
      [
        "패",
        "턴을"
      ],
      [
        "프",
        "로그램"
      ],
      [
        "하",
        "여"
      ],
      [
        "기술",
        "을"
      ],
      [
        "러닝",
        "의"
      ],
      [
        "인공",
        "신경망"
      ],
      [
        "학습",
        "할"
      ],
      [
        "학습",
        "하고"
      ],
      [
        "머신",
        "러닝은"
      ],
      [
        "머신",
        "러닝의"
      ],
      [
        "처리",
        "는"
      ],
      [
        "처리",
        "할"
      ],
      [
        "인공지능",
        "은"
      ],
      [
        "인공지능",
        "의"
      ],
      [
        "과학",
        "의"
      ],
      [
        "기반",
        "으로"
      ],
      [
        "데이",
        "터를"
      ],
      [
        "복잡",
        "한"
      ],
      [
        "실현",
        "하는"
      ],
      [
        "알고리",
        "즘과"
      ],
      [
        "연구한",
        "다"
      ],
      [
        "예측",
        "할"
      ],
      [
        "이해",
        "하고"
      ],
      [
        "프로그램",
        "을"
      ],
      [
        "인공신경망",
        "을"
      ]
    ]
  }
}