{
    "architectures": [
        "LlamaForCausalLM"
    ],
    "head_dim": 64,
    "hidden_size": 256,
    "intermediate_size": 1024,
    "max_position_embeddings": 2048,
    "model_type": "llama",
    "num_attention_heads": 4,
    "num_hidden_layers": 4,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 10000.0,
    "rope_traditional": false,
    "tie_word_embeddings": true,
    "vocab_size": 32000
}